{
    "glossary": [
        {
            "id": 1,
            "word": "Web-приложение",
            "description": "Клиент-серверное приложение, в котором клиент взаимодействует с веб-сервером при помощи браузера. Логика веб-приложения распределена между сервером и клиентом, хранение данных осуществляется, преимущественно, на сервере, обмен информацией происходит по сети."
        },
        {
            "id": 2,
            "word": "Клиент",
            "description": "Программное или аппаратное обеспечение, которое используется для получения доступа к сервисам, предоставляемым сервером. В контексте веб-приложений, клиент – это часть приложения, выполняющаяся на стороне пользователя (например, в веб-браузере)."
        },
        {
            "id": 3,
            "word": "Сервер",
            "description": "Вычислительное устройство или программное обеспечение, предназначенное для предоставления сервисов или ресурсов другим программам (клиентам) в сети."
        },
        {
            "id": 4,
            "word": "Язык программирования",
            "description": "Формальный язык, используемый для написания программ, которые могут быть выполнены компьютером."
        },
        {
            "id": 5,
            "word": "Масштабируемость",
            "description": "Способность системы или приложения справляться с увеличением объема работы, ресурсов или пользовательской базы без потери производительности."
        },
        {
            "id": 6,
            "word": "Надежность",
            "description": "Способность системы или приложения выполнять свои функции без сбоев и с минимальным уровнем ошибок. Обеспечение надежности является фундаментальным требованием для построения высоконагруженных систем."
        },
        {
            "id": 7,
            "word": "Производительность",
            "description": "Эффективность выполнения задач и обработки запросов системой или приложением. Высокая производительность означает способность обеспечивать быстрый отклик на запросы пользователей и эффективное использование ресурсов."
        },
        {
            "id": 8,
            "word": "Архитектура",
            "description": "Совокупность программных и аппаратных средств, составляющая информационную систему организации и включающая, в частности, базы данных и промежуточное программное обеспечение."
        },
        {
            "id": 9,
            "word": "Шаблон проектирования или паттерн",
            "description": "Повторяемая архитектурная конструкция, представляющая собой решение проблемы проектирования в рамках некоторого часто возникающего контекста."
        },
        {
            "id": 10,
            "word": "Go",
            "description": "Компилируемый, многопоточный язык программирования, разработанный в Google, ориентированный на простоту кода, эффективность и легкость работы с параллелизмом."
        },
        {
            "id": 11,
            "word": "Высоконагруженные системы",
            "description": "Системы, спроектированные для обработки больших объемов запросов при высокой интенсивности нагрузки."
        },
        {
            "id": 12,
            "word": "Микросервисная архитектура",
            "description": "Архитектурный подход, при котором приложение разделяется на небольшие, независимые и взаимодействующие микросервисы."
        },
        {
            "id": 13,
            "word": "Кеширование",
            "description": "Механизм временного хранения данных в оперативной памяти для быстрого доступа и снижения нагрузки на базовые источники данных."
        },
        {
            "id": 14,
            "word": "Репликация",
            "description": "Процесс создания и поддержания точных копий данных в разных узлах системы с целью обеспечения отказоустойчивости и распределения нагрузки."
        },
        {
            "id": 15,
            "word": "Шардирование",
            "description": "Разделение базы данных на фрагменты (шарды) для распределения данных и запросов между разными серверами."
        },
        {
            "id": 16,
            "word": "Очереди",
            "description": "Механизм передачи и обработки сообщений между компонентами системы с использованием промежуточного хранилища."
        },
        {
            "id": 17,
            "word": "Контейнеризация",
            "description": "Технология упаковки приложения и его зависимостей в контейнер, обеспечивающая консистентность и переносимость между различными окружениями."
        },
        {
            "id": 18,
            "word": "Оркестрация",
            "description": "Автоматизация развертывания, масштабирования и управления контейнеризированными приложениями в среде, включая управление ресурсами и сетевой конфигурацией."
        },
        {
            "id": 19,
            "word": "Базы данных",
            "description": "Cистемы для организации, хранения и управления данными. Они обеспечивают структурированный способ хранения информации, позволяя эффективно извлекать и обрабатывать данные."
        },
        {
            "id": 20,
            "word": "Реляционные базы данных",
            "description": "Хранят данные в виде таблиц, связанных друг с другом, обеспечивая соблюдение принципов ACID (атомарность, согласованность, изолированность, долговечность)."
        },
        {
            "id": 21,
            "word": "NoSQL базы данных",
            "description": "Позволяют хранить и извлекать данные, не следуя строгой структуре таблиц, что особенно полезно в случае семантически гибких данных."
        },
        {
            "id": 22,
            "word": "In-memory базы данных",
            "description": "Хранят данные в оперативной памяти для максимальной производительности при доступе к данным."
        }
    ]
}
